In [2]:
import pandas as pd

In [3]:
pd.Series([1,2,3,4])#indeksi de data tipinin içinde tutuyor

0    1
1    2
2    3
3    4
dtype: int64

In [83]:
seri=pd.Series([1,2,3,4])

In [84]:
type(seri)

pandas.core.series.Series

In [85]:
print(type(seri))

<class 'pandas.core.series.Series'>

In [86]:
seri.axes

[RangeIndex(start=0, stop=4, step=1)]

In [87]:
seri.ndim

1

In [88]:
seri.dtype

dtype('int64')

In [89]:
seri.size

4

In [90]:
seri.values

array([1, 2, 3, 4], dtype=int64)

In [92]:
seri.index

RangeIndex(start=0, stop=4, step=1)

In [93]:
seri.head()

0    1
1    2
2    3
3    4
dtype: int64

In [94]:
seri.head(3)

0    1
1    2
2    3
dtype: int64

In [95]:
seri.head(4)#bütün içeriği(başlığı) baştan gösteriyor

0    1
1    2
2    3
3    4
dtype: int64

In [20]:
seri.tail(2)#sondan gösteriyor

2    3
3    4
dtype: int64

In [21]:
pd.Series([99,2,332,94,5])

0     99
1      2
2    332
3     94
4      5
dtype: int64

In [23]:
pd.Series([99,2,332,94,5],index=[1,2,15,7,8])

1      99
2       2
15    332
7      94
8       5
dtype: int64

In [29]:
pd.Series([99,2,332,94,5],index=[1,2,3.4,True,"a"])

1        99
2         2
3.4     332
True     94
a         5
dtype: int64

In [32]:
seri=pd.Series([99,2,332,94,5],index=[1,2,3.4,True,"a"])

In [33]:
seri["a"]

5

In [34]:
seri[3.4:"a"]

3.4     332
True     94
a         5
dtype: int64

In [40]:
sözlük=pd.Series({"reg":10,"log":11,"cart":12})

In [41]:
sözlük

reg     10
log     11
cart    12
dtype: int64

In [42]:
sözlük={"reg":10,"log":11,"cart":12}

In [46]:
seri=pd.Series(sözlük)

In [47]:
seri

reg     10
log     11
cart    12
dtype: int64

In [49]:
pd.concat([seri,seri])#serileri birleştirme

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

In [1]:
import numpy as np

In [5]:
a=np.array([1,2,33,45,776])

In [10]:
indeks=[1,2,3,4,5]

In [52]:
seri=pd.Series(a)

In [53]:
seri

0      1
1      2
2     33
3     45
4    776
dtype: int32

In [11]:
pd.Series(a,indeks)

1      1
2      2
3     33
4     45
5    776
dtype: int32

In [12]:
pd.Series(data=a,index=indeks)

1      1
2      2
3     33
4     45
5    776
dtype: int32

In [54]:
seri[0]

1

In [55]:
seri[0:3]

0     1
1     2
2    33
dtype: int32

In [56]:
seri=pd.Series([112,232,23,45],index=["reg","log","cart","rf"])

In [57]:
seri

reg     112
log     232
cart     23
rf       45
dtype: int64

In [59]:
seri.index#indekslere erişim

Index(['reg', 'log', 'cart', 'rf'], dtype='object')

In [64]:
list(seri.keys())

['reg', 'log', 'cart', 'rf']

In [66]:
seri.values

array([112, 232,  23,  45], dtype=int64)

In [61]:
list(seri.items())

[('reg', 112), ('log', 232), ('cart', 23), ('rf', 45)]

In [67]:
"reg" in seri

True

In [68]:
"a" in seri

False

In [69]:
seri["reg"]

112

In [70]:
seri[["reg","rf"]]

reg    112
rf      45
dtype: int64

In [71]:
seri["reg"]=130

In [73]:
seri["reg"]

130

In [74]:
seri

reg     130
log     232
cart     23
rf       45
dtype: int64

In [81]:
seri["reg":"log"]

reg    130
log    232
dtype: int64

In [96]:
l=[1,2,45,69,956]

In [97]:
l

[1, 2, 45, 69, 956]

In [100]:
pd.DataFrame(l,columns=["degisken_ismi"])

   degisken_ismi
0              1
1              2
2             45
3             69
4            956

In [14]:
m=np.arange(1,10).reshape(3,3)

In [15]:
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [24]:
df=pd.DataFrame(m)

In [25]:
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [26]:
df[0]

0    1
1    4
2    7
Name: 0, dtype: int32

In [28]:
df.loc[0]

0    1
1    2
2    3
Name: 0, dtype: int32

In [30]:
df.loc[0][1]

2

In [29]:
df.iloc[0]#burda mesela satırda(satırda zeynep kelimesi olduğu düşün mesela) ne yazsa bile verir indeks sayısını girmek yeterli

0    1
1    2
2    3
Name: 0, dtype: int32

In [32]:
df.iloc[0][2]

3

In [33]:
df.iloc[0,2]

3

In [105]:
pd.DataFrame(m,columns=["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [36]:
df=pd.DataFrame(m,index=[1,2,3],columns=["var1","var2","var3"])

In [37]:
df.head()

   var1  var2  var3
1     1     2     3
2     4     5     6
3     7     8     9

In [38]:
df.reset_index()

   index  var1  var2  var3
0      1     1     2     3
1      2     4     5     6
2      3     7     8     9

In [39]:
m=[1,2,3]

In [41]:
df.set_index("m")#olucak ama m nin önce column da olması lazım yani data frame de column halinde olması lzm

KeyError: "None of ['m'] are in the columns"

In [109]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [110]:
df.columns=("deg1","deg2","deg3")

In [111]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [112]:
type(df)

pandas.core.frame.DataFrame

In [113]:
df.axes#eksenleri yani satır ve sütünların bilgilerini çıkarıyo axes fonksiyonu

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [114]:
df.shape

(3, 3)

In [115]:
df.ndim

2

In [116]:
df.size

9

In [117]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [118]:
type(df.values)

numpy.ndarray

In [121]:
df.head(1)

   deg1  deg2  deg3
0     1     2     3

In [122]:
df.tail(1)

   deg1  deg2  deg3
2     7     8     9

In [123]:
a=np.array([1,2,3,4])

In [124]:
pd.DataFrame(a,columns=["deg1"])

   deg1
0     1
1     2
2     3
3     4

In [167]:
s1=np.random.randint(10,size=5)
s2=np.random.randint(10,size=5)
s3=np.random.randint(10,size=5)

In [168]:
sözlük={"var1":s1,"var2":s2,"var3":s3}

In [169]:
sözlük

{'var1': array([7, 6, 3, 6, 9]),
 'var2': array([7, 4, 2, 3, 5]),
 'var3': array([1, 4, 5, 2, 6])}

In [170]:
df=pd.DataFrame(sözlük)

In [171]:
df

   var1  var2  var3
0     7     7     1
1     6     4     4
2     3     2     5
3     6     3     2
4     9     5     6

In [172]:
df[0:1]

   var1  var2  var3
0     7     7     1

In [173]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [174]:
df.index=["a","b","c","d","e"]

In [177]:
df

   var1  var2  var3
a     7     7     1
b     6     4     4
c     3     2     5
d     6     3     2
e     9     5     6

In [178]:
df["c":"e"]

   var1  var2  var3
c     3     2     5
d     6     3     2
e     9     5     6

In [179]:
df.drop("a",axis=0)#satırdaki elemanı silme

   var1  var2  var3
b     6     4     4
c     3     2     5
d     6     3     2
e     9     5     6

In [180]:
df

   var1  var2  var3
a     7     7     1
b     6     4     4
c     3     2     5
d     6     3     2
e     9     5     6

In [181]:
df.drop("a",axis=0,inplace=True)#kalıcı olarak silme gerçekleştirir

In [182]:
df

   var1  var2  var3
b     6     4     4
c     3     2     5
d     6     3     2
e     9     5     6

In [183]:
l=["c","e"]

In [184]:
df.drop(l,axis=0)#default olarak satırdan siliyor

   var1  var2  var3
b     6     4     4
d     6     3     2

In [185]:
"var1" in df

True

In [186]:
l=["var1","var4","var2"]
for i in l:
    print(i in df)

True
False
True

In [187]:
df

   var1  var2  var3
b     6     4     4
c     3     2     5
d     6     3     2
e     9     5     6

In [188]:
df["var1"]

b    6
c    3
d    6
e    9
Name: var1, dtype: int32

In [189]:
df["var4"]=df["var1"]/df["var2"]

In [190]:
df

   var1  var2  var3  var4
b     6     4     4   1.5
c     3     2     5   1.5
d     6     3     2   2.0
e     9     5     6   1.8

In [191]:
df.drop("var4",axis=1)

   var1  var2  var3
b     6     4     4
c     3     2     5
d     6     3     2
e     9     5     6

In [192]:
df

   var1  var2  var3  var4
b     6     4     4   1.5
c     3     2     5   1.5
d     6     3     2   2.0
e     9     5     6   1.8

In [193]:
df.drop("var4",axis=1,inplace=True)

In [194]:
df

   var1  var2  var3
b     6     4     4
c     3     2     5
d     6     3     2
e     9     5     6

In [197]:
l=["var1","var2"]

In [198]:
df.drop(l,axis=1)

   var3
b     4
c     5
d     2
e     6

In [199]:
df

   var1  var2  var3
b     6     4     4
c     3     2     5
d     6     3     2
e     9     5     6

In [201]:
m=np.random.randint(1,30 ,size=(10,3))
df=pd.DataFrame(m,columns=["var1","var2","var3"])
df

   var1  var2  var3
0     3     6    25
1     8    25    11
2    13    27    14
3     2    21     7
4     5    28    13
5    16    19     7
6    18    21     9
7    17     9    12
8    29     7    16
9    26    28     6

In [ ]:
?np.random.randint #başına bi soru işaret konulduğunda kütüphanedeki objenin methodunun naptığını bize gösterir

In [202]:
df.loc[0:3]#tanımlandığı şekil ile seçim yapar

   var1  var2  var3
0     3     6    25
1     8    25    11
2    13    27    14
3     2    21     7

In [203]:
df.iloc[0:3]#alışık olduğumuz indeks şekliyle yapar

   var1  var2  var3
0     3     6    25
1     8    25    11
2    13    27    14

In [204]:
df.iloc[0,0]

3

In [205]:
df.iloc[:3,:2]

   var1  var2
0     3     6
1     8    25
2    13    27

In [206]:
df.loc[0:3,"var3"]

0    25
1    11
2    14
3     7
Name: var3, dtype: int32

In [208]:
df.iloc[0:3,1:3]

   var2  var3
0     6    25
1    25    11
2    27    14

In [209]:
df.iloc[0:3,1:3]["var3"]

0    25
1    11
2    14
Name: var3, dtype: int32

In [210]:
df

   var1  var2  var3
0     3     6    25
1     8    25    11
2    13    27    14
3     2    21     7
4     5    28    13
5    16    19     7
6    18    21     9
7    17     9    12
8    29     7    16
9    26    28     6

In [211]:
df["var1"]

0     3
1     8
2    13
3     2
4     5
5    16
6    18
7    17
8    29
9    26
Name: var1, dtype: int32

In [212]:
df["var1"][0:2]

0    3
1    8
Name: var1, dtype: int32

In [213]:
df[0:2]["var1"]

0    3
1    8
Name: var1, dtype: int32

In [215]:
df[0:2][["var1","var2"]]

   var1  var2
0     3     6
1     8    25

In [42]:
#multi index olayı

In [59]:
ilkindeksler=["simpson","simpson","simpson","southpark","southpark","southpark"]

In [60]:
icindeksler=["homer","bart","marge","cartman","kenny","kyle"]

In [61]:
birleşmişindeks=list(zip(ilkindeksler,icindeksler))

In [62]:
birleşmişindeks

[('simpson', 'homer'),
 ('simpson', 'bart'),
 ('simpson', 'marge'),
 ('southpark', 'cartman'),
 ('southpark', 'kenny'),
 ('southpark', 'kyle')]

In [63]:
birleşmişindeks=pd.MultiIndex.from_tuples(birleşmişindeks)

In [64]:
type(birleşmişindeks)

pandas.core.indexes.multi.MultiIndex

In [65]:
birleşmişindeks

MultiIndex([(  'simpson',   'homer'),
            (  'simpson',    'bart'),
            (  'simpson',   'marge'),
            ('southpark', 'cartman'),
            ('southpark',   'kenny'),
            ('southpark',    'kyle')],
           )

In [66]:
cızgıfılmlist=[[40,"A"],[10,"b"],[13,"c"],[15,"d"],[17,"e"],[18,"f"]]

In [67]:
df=pd.DataFrame(cızgıfılmlist,index=birleşmişindeks,columns=["yaş","meslek"])

In [68]:
df

                   yaş meslek
simpson   homer     40      A
          bart      10      b
          marge     13      c
southpark cartman   15      d
          kenny     17      e
          kyle      18      f

In [69]:
df.loc["simpson"]

       yaş meslek
homer   40      A
bart    10      b
marge   13      c

In [70]:
df.loc["southpark"]

         yaş meslek
cartman   15      d
kenny     17      e
kyle      18      f

In [72]:
df.loc["southpark"].loc["kenny"]

yaş       17
meslek     e
Name: kenny, dtype: object

In [73]:
df.index.names=["çizgi film","adı"]

In [74]:
df

                    yaş meslek
çizgi film adı
simpson    homer     40      A
           bart      10      b
           marge     13      c
southpark  cartman   15      d
           kenny     17      e
           kyle      18      f

In [216]:
df

   var1  var2  var3
0     3     6    25
1     8    25    11
2    13    27    14
3     2    21     7
4     5    28    13
5    16    19     7
6    18    21     9
7    17     9    12
8    29     7    16
9    26    28     6

In [217]:
df.var1

0     3
1     8
2    13
3     2
4     5
5    16
6    18
7    17
8    29
9    26
Name: var1, dtype: int32

In [218]:
df[df.var1>5]

   var1  var2  var3
1     8    25    11
2    13    27    14
5    16    19     7
6    18    21     9
7    17     9    12
8    29     7    16
9    26    28     6

In [219]:
df[df.var1>5]["var1"]

1     8
2    13
5    16
6    18
7    17
8    29
9    26
Name: var1, dtype: int32

In [222]:
df[(df.var1>15) & (df.var3<5)]

Empty DataFrame
Columns: [var1, var2, var3]
Index: []

In [224]:
df.loc[(df.var1>5),["var1","var2"]]

   var1  var2
1     8    25
2    13    27
5    16    19
6    18    21
7    17     9
8    29     7
9    26    28

In [240]:
df

   var1  var2  var3
0     3     6    25
1     8    25    11
2    13    27    14
3     2    21     7
4     5    28    13
5    16    19     7
6    18    21     9
7    17     9    12
8    29     7    16
9    26    28     6

In [241]:
df2=df+99

In [242]:
df2

   var1  var2  var3
0   102   105   124
1   107   124   110
2   112   126   113
3   101   120   106
4   104   127   112
5   115   118   106
6   117   120   108
7   116   108   111
8   128   106   115
9   125   127   105

In [243]:
pd.concat([df2,df])

   var1  var2  var3
0   102   105   124
1   107   124   110
2   112   126   113
3   101   120   106
4   104   127   112
5   115   118   106
6   117   120   108
7   116   108   111
8   128   106   115
9   125   127   105
0     3     6    25
1     8    25    11
2    13    27    14
3     2    21     7
4     5    28    13
5    16    19     7
6    18    21     9
7    17     9    12
8    29     7    16
9    26    28     6

In [244]:
pd.concat([df2,df],ignore_index=True)#3 tane df de birleşebilir

    var1  var2  var3
0    102   105   124
1    107   124   110
2    112   126   113
3    101   120   106
4    104   127   112
5    115   118   106
6    117   120   108
7    116   108   111
8    128   106   115
9    125   127   105
10     3     6    25
11     8    25    11
12    13    27    14
13     2    21     7
14     5    28    13
15    16    19     7
16    18    21     9
17    17     9    12
18    29     7    16
19    26    28     6

In [245]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [246]:
df2.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [247]:
df2.columns=["deg1","deg2","deg3"]

In [248]:
df2

   deg1  deg2  deg3
0   102   105   124
1   107   124   110
2   112   126   113
3   101   120   106
4   104   127   112
5   115   118   106
6   117   120   108
7   116   108   111
8   128   106   115
9   125   127   105

In [249]:
pd.concat([df,df2])#coulumlar farklı olduğu için yanyana ekledi ve kesişmeyen değerler oluştu

   var1  var2  var3   deg1   deg2   deg3
0   3.0   6.0  25.0    NaN    NaN    NaN
1   8.0  25.0  11.0    NaN    NaN    NaN
2  13.0  27.0  14.0    NaN    NaN    NaN
3   2.0  21.0   7.0    NaN    NaN    NaN
4   5.0  28.0  13.0    NaN    NaN    NaN
5  16.0  19.0   7.0    NaN    NaN    NaN
6  18.0  21.0   9.0    NaN    NaN    NaN
7  17.0   9.0  12.0    NaN    NaN    NaN
8  29.0   7.0  16.0    NaN    NaN    NaN
9  26.0  28.0   6.0    NaN    NaN    NaN
0   NaN   NaN   NaN  102.0  105.0  124.0
1   NaN   NaN   NaN  107.0  124.0  110.0
2   NaN   NaN   NaN  112.0  126.0  113.0
3   NaN   NaN   NaN  101.0  120.0  106.0
4   NaN   NaN   NaN  104.0  127.0  112.0
5   NaN   NaN   NaN  115.0  118.0  106.0
6   NaN   NaN   NaN  117.0  120.0  108.0
7   NaN   NaN   NaN  116.0  108.0  111.0
8   NaN   NaN   NaN  128.0  106.0  115.0
9   NaN   NaN   NaN  125.0  127.0  105.0

In [250]:
pd.concat([df,df2],join="inner")#sadece kesişen değerleri frame e ekler (NAN)lar kalktı

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [253]:
pd.concat([df,df2],join_axes=[df2.columns])

TypeError: concat() got an unexpected keyword argument 'join_axes'

In [260]:
df1=pd.DataFrame({"çalışanlar":["ali","veli","can","ahmet"],
                 "grup":["muhasebe","muhendislik","İK","hacı"]})
df1

  çalışanlar         grup
0        ali     muhasebe
1       veli  muhendislik
2        can           İK
3      ahmet         hacı

In [262]:
df2=pd.DataFrame({"çalışanlar":["ali","veli","can","ahmet"],
                "ilk giriş":[2010,2019,2018,2017]})
df2

  çalışanlar  ilk giriş
0        ali       2010
1       veli       2019
2        can       2018
3      ahmet       2017

In [264]:
pd.merge(df1,df2)#aynı değerden 1 tane olur (2 kere çalışanlar yazmadı)

  çalışanlar         grup  ilk giriş
0        ali     muhasebe       2010
1       veli  muhendislik       2019
2        can           İK       2018
3      ahmet         hacı       2017

In [267]:
df3=pd.merge(df1,df2,on="çalışanlar")

In [269]:
df3

  çalışanlar         grup  ilk giriş
0        ali     muhasebe       2010
1       veli  muhendislik       2019
2        can           İK       2018
3      ahmet         hacı       2017

In [281]:
df4=pd.DataFrame({"grup":["muhasebe","muhendislik","İK","hacı"],
                "müdür":["berkcan","murat","elif","eray"]})
df4

          grup    müdür
0     muhasebe  berkcan
1  muhendislik    murat
2           İK     elif
3         hacı     eray

In [273]:
pd.merge(df3,df4)#çoktan teke

  çalışanlar         grup  ilk giriş    müdür
0        ali     muhasebe       2010  berkcan
1       veli  muhendislik       2019    murat
2        can           İK       2018     elif
3      ahmet         hacı       2017     eray

In [282]:
df5=pd.DataFrame({"grup":["muhasebe","muhendislik","İK","hacı","muhasebe","İK"],
                 "yetenekler":["mat","excel","kodlama","linux","excel","yönetim"]})
df5

          grup yetenekler
0     muhasebe        mat
1  muhendislik      excel
2           İK    kodlama
3         hacı      linux
4     muhasebe      excel
5           İK    yönetim

In [280]:
pd.merge(df1,df5)#çoktan çoka ekleme

  çalışanlar         grup yetenekler
0        ali     muhasebe        mat
1        ali     muhasebe      excel
2       veli  muhendislik      excel
3        can           İK    kodlama
4        can           İK    yönetim
5      ahmet         hacı      linux

In [2]:
import seaborn as sns

In [284]:
df=sns.load_dataset("planets")

In [285]:
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [286]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [288]:
df.shape

(1035, 6)

In [289]:
df.size

6210

In [290]:
df.ndim

2

BAZI TOPLULAŞTIRMA(aggregation) FONKSİYONLARI
--------------------------------
count()
first()
last()
mean()
median()
max()
min()
var()
sum()
std()

In [291]:
df.count()

method            1035
number            1035
orbital_period     992
mass               513
distance           808
year              1035
dtype: int64

In [299]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [300]:
df["mass"].mean()

2.6381605847953233

In [301]:
df["mass"].count()

513

In [302]:
df["mass"].min()

0.0036

In [303]:
df["mass"].max()

25.0

In [304]:
df["mass"].sum()

1353.37638

In [305]:
df["mass"].std()

3.8186166509616046

In [306]:
df["mass"].var()

14.58183312700122

In [308]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [309]:
df.describe().T #TRANSPOSE

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [312]:
df.dropna().describe().T #eksik değerleri geçer

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

In [318]:
df=pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                "veri":[10,11,12,13,14,15]},columns=["gruplar","veri"])

In [319]:
df

  gruplar  veri
0       A    10
1       B    11
2       C    12
3       A    13
4       B    14
5       C    15

In [321]:
df.groupby("gruplar").mean()

         veri
gruplar
A        11.5
B        12.5
C        13.5

In [322]:
df.groupby("gruplar").sum()

         veri
gruplar
A          23
B          25
C          27

In [3]:
df=sns.load_dataset("planets")

In [4]:
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [324]:
df.groupby("method")

In [325]:
df.groupby("method")["orbital_period"]

In [326]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [327]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

In [341]:
df=pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                "degısken1":[12,23,35,46,57,69],
                "degısken2":[75,83,92,100,111,123]},
               columns=["gruplar","degısken1","degısken2"])
df

  gruplar  degısken1  degısken2
0       A         12         75
1       B         23         83
2       C         35         92
3       A         46        100
4       B         57        111
5       C         69        123

In [342]:
df.groupby("gruplar")

In [343]:
df.groupby("gruplar").mean()

         degısken1  degısken2
gruplar
A             29.0       87.5
B             40.0       97.0
C             52.0      107.5

In [345]:
df.groupby("gruplar").aggregate([min,np.median,max])#birden fazla fonku uygulama

        degısken1            degısken2
              min median max       min median  max
gruplar
A              12     29  46        75   87.5  100
B              23     40  57        83   97.0  111
C              35     52  69        92  107.5  123

In [348]:
df.groupby("gruplar").aggregate({"degısken1":min,"degısken2":max})

         degısken1  degısken2
gruplar
A               12        100
B               23        111
C               35        123

In [349]:
df=pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                "degısken1":[12,23,35,46,57,69],
                "degısken2":[75,83,92,100,111,123]},
               columns=["gruplar","degısken1","degısken2"])
df

  gruplar  degısken1  degısken2
0       A         12         75
1       B         23         83
2       C         35         92
3       A         46        100
4       B         57        111
5       C         69        123

In [361]:
def filter_func(x):
    return x["degısken1"].std()>9#bu fonku aplly ile de çalıştırabiliriz

In [362]:
df.groupby("gruplar")

In [363]:
df.groupby("gruplar").std()

         degısken1  degısken2
gruplar
A        24.041631   17.67767
B        24.041631   19.79899
C        24.041631   21.92031

In [364]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degısken1  degısken2
0       A         12         75
1       B         23         83
2       C         35         92
3       A         46        100
4       B         57        111
5       C         69        123

In [365]:
df=pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                "degısken1":[12,23,35,46,57,69],
                "degısken2":[75,83,92,100,111,123]},
               columns=["gruplar","degısken1","degısken2"])
df

  gruplar  degısken1  degısken2
0       A         12         75
1       B         23         83
2       C         35         92
3       A         46        100
4       B         57        111
5       C         69        123

In [366]:
df["degısken1"]*9

0    108
1    207
2    315
3    414
4    513
5    621
Name: degısken1, dtype: int64

In [368]:
df_a=df.iloc[:,1:3]

In [373]:
df_a.transform(lambda x:x-x.mean())#groupby fonk uyla da yapılabilir

   degısken1  degısken2
0 -28.333333 -22.333333
1 -17.333333 -14.333333
2  -5.333333  -5.333333
3   5.666667   2.666667
4  16.666667  13.666667
5  28.666667  25.666667

In [374]:
df_a.transform(lambda x:(x-x.mean())/x.std())

   degısken1  degısken2
0  -1.331706  -1.254233
1  -0.814691  -0.804956
2  -0.250674  -0.299518
3   0.266341   0.149759
4   0.783357   0.767516
5   1.347373   1.441432

In [386]:
df=pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                "degısken1":[12,23,35,46,57,69],
                "degısken2":[75,83,92,100,111,123]},
               columns=["gruplar","degısken1","degısken2"])
df

  gruplar  degısken1  degısken2
0       A         12         75
1       B         23         83
2       C         35         92
3       A         46        100
4       B         57        111
5       C         69        123

In [384]:
df.apply(np.sum)

degısken1    242
degısken2    584
dtype: int64

In [385]:
df.apply(np.mean)

degısken1    40.333333
degısken2    97.333333
dtype: float64

In [387]:
df.groupby("gruplar").apply(np.sum)

        gruplar  degısken1  degısken2
gruplar
A            AA         58        175
B            BB         80        194
C            CC        104        215

In [388]:
df.groupby("gruplar").apply(np.mean)

         degısken1  degısken2
gruplar
A             29.0       87.5
B             40.0       97.0
C             52.0      107.5

In [5]:
titanic=sns.load_dataset("titanic")
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [6]:
titanic.head().T

                       0          1            2            3            4
survived               0          1            1            1            0
pclass                 3          1            3            1            3
sex                 male     female       female       female         male
age                 22.0       38.0         26.0         35.0         35.0
sibsp                  1          1            0            1            0
parch                  0          0            0            0            0
fare                7.25    71.2833        7.925         53.1         8.05
embarked               S          C            S            S            S
class              Third      First        Third        First        Third
who                  man      woman        woman        woman          man
adult_male          True      False        False        False         True
deck                 NaN          C          NaN            C          NaN
embark_town  Southampton  Cherbourg  Southampton  Southampton  Southampton
alive                 no        yes          yes          yes           no
alone              False      False         True        False         True

In [393]:
titanic.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [392]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [396]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [397]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [399]:
titanic.pivot_table("survived",index="sex",columns="class")#values da koyulabilir başına

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [ ]:
#ve sonunca aggfunc=np.sum tarzı argümanlar ekleyip fonk u uygulayabiliriz

In [404]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [409]:
age=pd.cut(titanic["age"],[0,18,90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [410]:
titanic.pivot_table("survived",["sex",age],"class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

In [3]:
pd.read_csv("reading_data/ornekcsv.csv")#csv dosyası okuma

FileNotFoundError: [Errno 2] No such file or directory: 'reading_data/ornekcsv.csv'

In [ ]:
pd.read_csv("reading_data/duzmetin.txt")#virgüllü ayırılan tablo tarzı dökümanlar csv şeklindedir

In [ ]:
pd.read_csv("reading_data/ornekcsv.csv",sep=;)#virgüllü ayırılan tablo tarzı dökümanlar csv şeklindedir

In [ ]:
pd.read_excel("reading_data/excelx_xls")#excel dosyası okuma

In [ ]:
#.to_excel dersek yeni değeri excele kaydetmiş oluruz

hepsi birer data frame halinde bize ıde'de gösterir